Coq_notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-02-19 Fri 17:31 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Index</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Platypus" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Index</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline7">1. Computation</a>
<ul>
<li><a href="#orgheadline4">1.1. Eval</a>
<ul>
<li><a href="#orgheadline1">1.1.1. Compute</a></li>
<li><a href="#orgheadline2">1.1.2. cbv</a></li>
<li><a href="#orgheadline3">1.1.3. cbn (8.5)</a></li>
</ul>
</li>
<li><a href="#orgheadline5">1.2. Simpl</a></li>
<li><a href="#orgheadline6">1.3. Reflexivity</a></li>
</ul>
</li>
<li><a href="#orgheadline10">2. Intro patterns</a>
<ul>
<li><a href="#orgheadline8">2.1. With square brackets</a></li>
<li><a href="#orgheadline9">2.2. Tricks</a></li>
</ul>
</li>
<li><a href="#orgheadline13">3. Notations</a>
<ul>
<li><a href="#orgheadline11">3.1. Precedence levels</a></li>
<li><a href="#orgheadline12">3.2. Associativity</a></li>
</ul>
</li>
<li><a href="#orgheadline14">4. The Case tactic</a></li>
<li><a href="#orgheadline17">5. Arguments</a>
<ul>
<li><a href="#orgheadline15">5.1. Implicit arguments</a></li>
<li><a href="#orgheadline16">5.2. Arguments renaming</a></li>
</ul>
</li>
<li><a href="#orgheadline18">6. Generalize dependent versus generalize versus revert</a></li>
<li><a href="#orgheadline22">7. Duplicating an hypothesis</a>
<ul>
<li><a href="#orgheadline19">7.1. With remember</a></li>
<li><a href="#orgheadline20">7.2. With generalize dependent</a></li>
<li><a href="#orgheadline21">7.3. With assert</a></li>
</ul>
</li>
<li><a href="#orgheadline29">8. Working with Ltac</a>
<ul>
<li><a href="#orgheadline25">8.1. Matching on hypotheses and conclusions</a>
<ul>
<li><a href="#orgheadline23">8.1.1. Hypotheses</a></li>
<li><a href="#orgheadline24">8.1.2. Conclusions</a></li>
</ul>
</li>
<li><a href="#orgheadline26">8.2. Generate fresh names</a></li>
<li><a href="#orgheadline27">8.3. Print Ltac</a></li>
<li><a href="#orgheadline28">8.4. Working with PG</a></li>
</ul>
</li>
<li><a href="#orgheadline30">9. Show the axioms used for a given lemma</a></li>
<li><a href="#orgheadline33">10. Using tactics like reflexivity over user built relations</a>
<ul>
<li><a href="#orgheadline31">10.1. Adding equivalence relations, preorder, etc&#x2026;</a></li>
<li><a href="#orgheadline32">10.2. Adding morphisms</a></li>
</ul>
</li>
<li><a href="#orgheadline34">11. <span class="todo nilTODO">TODO</span> : pattern matching. Unify with intro patterns and talk about the let, let with the backstick</a></li>
<li><a href="#orgheadline35">12. <span class="todo nilTODO">TODO</span> : switching goals</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline7" class="outline-2">
<h2 id="orgheadline7"><span class="section-number-2">1</span> Computation</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">1.1</span> Eval</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-orgheadline1" class="outline-4">
<h4 id="orgheadline1"><span class="section-number-4">1.1.1</span> Compute</h4>
</div>
<div id="outline-container-orgheadline2" class="outline-4">
<h4 id="orgheadline2"><span class="section-number-4">1.1.2</span> cbv</h4>
</div>
<div id="outline-container-orgheadline3" class="outline-4">
<h4 id="orgheadline3"><span class="section-number-4">1.1.3</span> cbn (8.5)</h4>
</div>
</div>
<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5"><span class="section-number-3">1.2</span> Simpl</h3>
</div>
<div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6"><span class="section-number-3">1.3</span> Reflexivity</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Reflexivity does more than simpl, it notably tries to unfold definitions.
</p>
</div>
</div>
</div>


<div id="outline-container-orgheadline10" class="outline-2">
<h2 id="orgheadline10"><span class="section-number-2">2</span> Intro patterns</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orgheadline8" class="outline-3">
<h3 id="orgheadline8"><span class="section-number-3">2.1</span> With square brackets</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Conjunction: just a list with no separators
Ex: <code>[H1 [H2 H3]]</code> or <code>(H1 &amp; H2 &amp; H3)</code>
Disjunction: <code>|</code>
Ex: <code>[H1 | H2]</code>
</p>
</div>
</div>
<div id="outline-container-orgheadline9" class="outline-3">
<h3 id="orgheadline9"><span class="section-number-3">2.2</span> Tricks</h3>
<div class="outline-text-3" id="text-2-2">
<p>
&lt;- or -&gt; to rewrite directly an equality.
_ clear the hypothesis directly
? to let coq choose the name
</p>
</div>
</div>
</div>


<div id="outline-container-orgheadline13" class="outline-2">
<h2 id="orgheadline13"><span class="section-number-2">3</span> Notations</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-orgheadline11" class="outline-3">
<h3 id="orgheadline11"><span class="section-number-3">3.1</span> Precedence levels</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Go from 0 (tightest) to 100, with an additionnal special 200.
</p>
</div>
</div>
<div id="outline-container-orgheadline12" class="outline-3">
<h3 id="orgheadline12"><span class="section-number-3">3.2</span> Associativity</h3>
<div class="outline-text-3" id="text-3-2">
<p>
No associativity
Left associativity
Right associativity
</p>
</div>
</div>
</div>


<div id="outline-container-orgheadline14" class="outline-2">
<h2 id="orgheadline14"><span class="section-number-2">4</span> The Case tactic</h2>
<div class="outline-text-2" id="text-4">
<p>
From Software Foundation, used to keep track of the ongoing case
</p>

<div class="org-src-container">

<pre class="src src-coq">Require String. Open Scope string_scope.

Ltac move_to_top x :=
match reverse goal with
| H : _ | - _ =&gt; try move x after H |
end.

Tactic Notation "assert_eq" ident(x) constr(v) :=
let H := fresh in
assert (x = v) as H by reflexivity;
clear H.

Tactic Notation "Case_aux" ident(x) constr(name) :=
first [
set (x := name); move_to_top x
| assert_eq x name; move_to_top x
| fail 1 "because we are working on a different case" ].

Tactic Notation "Case" constr(name) := Case_aux Case name.
Tactic Notation "SCase" constr(name) := Case_aux SCase name.
Tactic Notation "SSCase" constr(name) := Case_aux SSCase name.
Tactic Notation "SSSCase" constr(name) := Case_aux SSSCase name.
Tactic Notation "SSSSCase" constr(name) := Case_aux SSSSCase name.
Tactic Notation "SSSSSCase" constr(name) := Case_aux SSSSSCase name.
Tactic Notation "SSSSSSCase" constr(name) := Case_aux SSSSSSCase name.
Tactic Notation "SSSSSSSCase" constr(name) := Case_aux SSSSSSSCase name.
</pre>
</div>
</div>
</div>


<div id="outline-container-orgheadline17" class="outline-2">
<h2 id="orgheadline17"><span class="section-number-2">5</span> Arguments</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-orgheadline15" class="outline-3">
<h3 id="orgheadline15"><span class="section-number-3">5.1</span> Implicit arguments</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Implicit arguments are treated the same way as if provided as an _, but systematically.
We can declare them at define time by putting curly brackets around the argument.
</p>

<div class="org-src-container">

<pre class="src src-coq">Inductive list {A : Type} : Type :=
 | nil : list
 | cons : A -&gt; list -&gt; list.
</pre>
</div>

<p>
Afterwards, through the Arguments directive: name and list of arguments, curly
brackets for the ones to be inferred.
</p>

<p>
Use an @ to disable implicit arguments locally.
</p>

<div class="org-src-container">

<pre class="src src-coq">Definition l : @list nat := ... .
</pre>
</div>
</div>
</div>


<div id="outline-container-orgheadline16" class="outline-3">
<h3 id="orgheadline16"><span class="section-number-3">5.2</span> Arguments renaming</h3>
<div class="outline-text-3" id="text-5-2">
<p>
Arguments can be used to rename arguments using the rename flag (:rename. at the end of the command).
(PW: explain? example?)
</p>
</div>
</div>
</div>


<div id="outline-container-orgheadline18" class="outline-2">
<h2 id="orgheadline18"><span class="section-number-2">6</span> Generalize dependent versus generalize versus revert</h2>
<div class="outline-text-2" id="text-6">
<p>
Starting from a goal
</p>
<div class="org-src-container">

<pre class="src src-coq">a, b : A
EQ : a = b
---------
  b = a
</pre>
</div>

<p>
One can use different tactics to move hypotheses from the context to the goal.
</p>

<div class="org-src-container">

<pre class="src src-coq">revert EQ

a, b : A
---------
a = b -&gt; b = a
</pre>
</div>
<p>
OR
</p>
<div class="org-src-container">

<pre class="src src-coq">generalize EQ

a, b : A
EQ : a = b
---------
a = b -&gt; b = a
</pre>
</div>

<p>
Notice that the generalized hypothesis is still present in the context, contrary to the reverted one.
</p>

<p>
We can also generalize terms of type in Type.
</p>

<div class="org-src-container">

<pre class="src src-coq">generalize a

a, b : A
EQ : a = b
---------
forall a0: A, b = a0
</pre>
</div>

<p>
Here we have lost some information, because the <code>a</code> in the context is no longer related to the new one.
This situation is solved using generalize dependent.
</p>

<div class="org-src-container">

<pre class="src src-coq">generalize dependent a

b : A
---------
forall a : A, a = b -&gt; b = a
</pre>
</div>
</div>
</div>


<div id="outline-container-orgheadline22" class="outline-2">
<h2 id="orgheadline22"><span class="section-number-2">7</span> Duplicating an hypothesis</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-orgheadline19" class="outline-3">
<h3 id="orgheadline19"><span class="section-number-3">7.1</span> With remember</h3>
<div class="outline-text-3" id="text-7-1">
<div class="org-src-container">

<pre class="src src-coq">Ltac dup H :=
let H' := fresh "H" in
remember H as H'; clear HeqH'.
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline20" class="outline-3">
<h3 id="orgheadline20"><span class="section-number-3">7.2</span> With generalize dependent</h3>
<div class="outline-text-3" id="text-7-2">
<div class="org-src-container">

<pre class="src src-coq">Ltac dup H :=
let H' := fresh "H" in
generalize dependent H; intros H'.
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline21" class="outline-3">
<h3 id="orgheadline21"><span class="section-number-3">7.3</span> With assert</h3>
<div class="outline-text-3" id="text-7-3">
<div class="org-src-container">

<pre class="src src-coq">Ltac dup H :=
let n := fresh H in
assert (n := H)
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-orgheadline29" class="outline-2">
<h2 id="orgheadline29"><span class="section-number-2">8</span> Working with Ltac</h2>
<div class="outline-text-2" id="text-8">
</div><div id="outline-container-orgheadline25" class="outline-3">
<h3 id="orgheadline25"><span class="section-number-3">8.1</span> Matching on hypotheses and conclusions</h3>
