Coq_notes.org
*** Hypotheses
Looking for an hypothesis of the form P x y, for any x and y.

#+BEGIN_SRC coq
  match goal with
    H : P ?x ?y |- _ => destruct H; auto
  end.
#+END_SRC
This will fail if no such hypothesis exists.
You can add ~try~ in front of it.

To match *all* such hypotheses, add ~repeat~.


The following example shows how to use hypotheses matching to remove duplicates in hypotheses.

#+BEGIN_SRC coq
  Goal P x y -> P x y -> P x z -> P x z -> P x z -> P y z.
  Proof.
    intros.

    repeat match goal with
      H1 : P ?x ?y,
          H2: P ?x ?y |- _ => clear H1
    end.
  Qed.
#+END_SRC

We try to match two hypotheses of the form P ?x ?y. The pattern matching is
 strong enough to express that H1 and H2 must refer to the same x and y.
H1 and H2 are guaranteed to be different though.

It is also possible to match part of an hypothesis.
Using ~context~:
#+BEGIN_SRC coq
match goal with
  H : context [P ?x ?y] |- _ => (* do stuff *)
end.
#+END_SRC

*** Conclusions

The matching can also be made on the conlusion of the goal (after ~|-~):
#+BEGIN_SRC coq
match goal with
  |- context [P ?x ?y] => (* do stuff *)
end.
#+END_SRC

Of course, multiple patterns can be matched.
#+BEGIN_SRC coq
repeat match goal with
  H : context [P ?x ?y] |- _ => (* do stuff *)
| |- context [P ?x ?y] => (* do stuff *)
end.
#+END_SRC
This will loop as long as either the hypotheses or the conclusion contain a term matching ~P ?x ?y~.
Be sure to remove the matching hypotheses to enforce termination.



** Generate fresh names

Sometimes we need to generate fresh names inside tactics:
#+BEGIN_SRC coq
  let n := fresh in (* generate new name, probably H0, H1, H2 *)
  intro n

  let n := fresh H in (* generate new name, based on the name of H *)
  intro n

  let n := fresh "H" in (* generate new name, based on the given string "H" *)
  intro n

#+END_SRC

** Print Ltac
One can view the Ltac code of a tactic (when it's actually written in Ltac).
#+BEGIN_SRC coq
  Print Ltac inv.

  --->
  Ltac inv H := inversion H; clear H; subst
#+END_SRC

** Working with PG

One can add custom keybindings to Emacs / PG.
For example, to see the Ltac code of a tactic (see previous section), we can define the following Emacs lisp code in the appropriate file (~/.emacs= in my case)

#+BEGIN_SRC elisp

(defun coq-Print-Ltac (withprintingall)
  "Ask for a tactic and Print Ltac it."
  (interactive "P")
  (if withprintingall
      (coq-ask-do-show-all "Print Ltac" "Print Ltac")
    (coq-ask-do "Print Ltac" "Print Ltac")))

(global-set-key (kbd "C-c C-$") 'coq-Print-Ltac)

#+END_SRC

(PW: I should investigate what occurences of "Print Ltac" stand for what)


* Show the axioms used for a given lemma

To show what axioms a given lemma depends on, one can use the following vernacular command

#+BEGIN_SRC coq
Print Assumptions my_lemma.
#+END_SRC

* Using tactics like reflexivity over user built relations
  The goal here is to be able to use Coq's built-in tactics over other relations than iff and eq, in particular relations that you have defined yourself.
** Adding equivalence relations, preorder, etc...

   The inner mechanism going on when using tactics like reflexivity, transitivity or symmetry are typeclasses. However Coq allows a particular facilities to declare new relations without digging into this.
   The syntax goes roughly as follows:

   #+BEGIN_SRC coq
   Add Parametric Relation (A: Type): A (@R A)
   reflexivity proved by ...
   symmetry proved by ...
   transitivity proved by ...
   as R_is_an_equivalence_relation.
   #+END_SRC 

   Note that you naturally only want to take A as a parameter if your relation is indeed polymorphic.
   For instance, suppose you need to manipulate predicates over program states up to propositional extentionnal equivalence. This relation is an equivalence relation, so you might want to declare is as so.

   #+BEGIN_SRC coq
   Axiom state: Type.
   Definition Pred: state -> Prop.
   Definition PEq (P1 P2: Pred): Prop := forall x, P1 x <-> P2 x.
   Lemma PEq_reflexive: forall P, P ≡ P.
   Proof.
     intros P s; go.
   Qed.

   Lemma PEq_trans: forall P1 P2 P3 (H1: P1 ≡ P2) (H2: P2 ≡ P3),
       P1 ≡ P3.
     intros P1 P2 P3 H1 H2 s; split; intros H3; [apply H2, H1 | apply H1,H2]; assumption.
   Qed. 
  
   Lemma PEq_symm: forall P1 P2 (H: P1 ≡ P2), P2 ≡ P1.
   Proof.
     intros P1 P2 H s; split; intros H'; apply H; assumption.
   Qed.

   Add Parametric Relation: Pred PEq
       reflexivity proved by PEq_reflexive
       symmetry proved by PEq_symm
       transitivity proved by PEq_trans
         as PEq_equiv.   
    
   #+END_SRC

   We now are able to prove goals such that (forall P: Pred, PEq P P) with a simpl (intros P; reflexivity). Same goes for transitivity and symmetry.

   Note that we can also only declare some of those properties, declaring that a relation is a preorder for instance:

   #+BEGIN_SRC coq
   Definition PWeaker (P1 P2: Pred): Prop := forall s, P2 s -> P1 s.

   Lemma PWeaker_reflexive: forall P, P ⊆ P.
   Proof.
     go.
   Qed.

   Lemma PWeaker_trans: forall P1 P2 P3 (H1: P1 ⊆ P2) (H2: P2 ⊆ P3), P1 ⊆ P3.
   Proof.
     intros P1 P2 P3 H1 H2 s H3; apply H1,H2,H3.
   Qed.

   Add Parametric Relation: Pred PWeaker
       reflexivity proved by PWeaker_reflexive
       transitivity proved by PWeaker_trans
         as PWeaker_preorder.   
   #+END_SRC

   In this case naturally symmetry will not work.
   Note that you are not obligated to provide directly the appropriate proof term in the relation declaration, you may use wildcards for Coq to ask you the proofs interactively.

   Remark: As said earlier, what is really going on is the typeclass mechanism. So all this is simply sugar for an instance declaration to the appropriate type class, Equivalence for instance in the first case. We could have written instead:

   #+BEGIN_SRC coq
   Require Import Classes.RelationClasses.

   Instance PEq_equiv: @Equivalence Pred PEq :=
    Equivalence_Reflexive := PEq_reflexive
    Equivalence_Symmetric := PEq_symm
    Equivalence_Transitive := PEq_trans. 
   #+END_SRC 

