Coq_notes.html
<div class="outline-text-3" id="text-8-1">
</div><div id="outline-container-orgheadline23" class="outline-4">
<h4 id="orgheadline23"><span class="section-number-4">8.1.1</span> Hypotheses</h4>
<div class="outline-text-4" id="text-8-1-1">
<p>
Looking for an hypothesis of the form P x y, for any x and y.
</p>

<div class="org-src-container">

<pre class="src src-coq">match goal with
  H : P ?x ?y |- _ =&gt; destruct H; auto
end.
</pre>
</div>
<p>
This will fail if no such hypothesis exists.
You can add <code>try</code> in front of it.
</p>

<p>
To match <b>all</b> such hypotheses, add <code>repeat</code>.
</p>

<p>
The following example shows how to use hypotheses matching to remove duplicates in hypotheses.
</p>

<div class="org-src-container">

<pre class="src src-coq">Goal P x y -&gt; P x y -&gt; P x z -&gt; P x z -&gt; P x z -&gt; P y z.
Proof.
  intros.

  repeat match goal with
    H1 : P ?x ?y,
	H2: P ?x ?y |- _ =&gt; clear H1
  end.
Qed.
</pre>
</div>

<p>
We try to match two hypotheses of the form <code>P ?x ?y</code>. The pattern matching is
 strong enough to express that H1 and H2 must refer to the same x and y.
H1 and H2 are guaranteed to be different though.
</p>

<p>
It is also possible to match part of an hypothesis.
Using <code>context</code>:
</p>
<div class="org-src-container">

<pre class="src src-coq">match goal with
  H : context [P ?x ?y] |- _ =&gt; (* do stuff *)
end.
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline24" class="outline-4">
<h4 id="orgheadline24"><span class="section-number-4">8.1.2</span> Conclusions</h4>
<div class="outline-text-4" id="text-8-1-2">
<p>
The matching can also be made on the conlusion of the goal (after <code>|-</code>):
</p>
<div class="org-src-container">

<pre class="src src-coq">match goal with
  |- context [P ?x ?y] =&gt; (* do stuff *)
end.
</pre>
</div>

<p>
Of course, multiple patterns can be matched.
</p>
<div class="org-src-container">

<pre class="src src-coq">repeat match goal with
  H : context [P ?x ?y] |- _ =&gt; (* do stuff *)
| |- context [P ?x ?y] =&gt; (* do stuff *)
end.
</pre>
</div>
<p>
This will loop as long as either the hypotheses or the conclusion contain a term matching <code>P ?x ?y</code>.
Be sure to remove the matching hypotheses to enforce termination.
</p>
</div>
</div>
</div>



<div id="outline-container-orgheadline26" class="outline-3">
<h3 id="orgheadline26"><span class="section-number-3">8.2</span> Generate fresh names</h3>
<div class="outline-text-3" id="text-8-2">
<p>
Sometimes we need to generate fresh names inside tactics:
</p>
<div class="org-src-container">

<pre class="src src-coq">let n := fresh in (* generate new name, probably H0, H1, H2 *)
intro n

let n := fresh H in (* generate new name, based on the name of H *)
intro n

let n := fresh "H" in (* generate new name, based on the given string "H" *)
intro n
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline27" class="outline-3">
<h3 id="orgheadline27"><span class="section-number-3">8.3</span> Print Ltac</h3>
<div class="outline-text-3" id="text-8-3">
<p>
One can view the Ltac code of a tactic (when it's actually written in Ltac).
</p>
<div class="org-src-container">

<pre class="src src-coq">Print Ltac inv.

---&gt;
Ltac inv H := inversion H; clear H; subst
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline28" class="outline-3">
<h3 id="orgheadline28"><span class="section-number-3">8.4</span> Working with PG</h3>
<div class="outline-text-3" id="text-8-4">
<p>
One can add custom keybindings to Emacs / PG.
For example, to see the Ltac code of a tactic (see previous section), we can define the following Emacs lisp code in the appropriate file (~/.emacs= in my case)
</p>

<div class="org-src-container">

<pre class="src src-elisp">(defun coq-Print-Ltac (withprintingall)
  "Ask for a tactic and Print Ltac it."
  (interactive "P")
  (if withprintingall
      (coq-ask-do-show-all "Print Ltac" "Print Ltac")
    (coq-ask-do "Print Ltac" "Print Ltac")))

(global-set-key (kbd "C-c C-$") 'coq-Print-Ltac)
</pre>
</div>

<p>
(PW: I should investigate what occurences of "Print Ltac" stand for what)
</p>
</div>
</div>
</div>


<div id="outline-container-orgheadline30" class="outline-2">
<h2 id="orgheadline30"><span class="section-number-2">9</span> Show the axioms used for a given lemma</h2>
<div class="outline-text-2" id="text-9">
<p>
To show what axioms a given lemma depends on, one can use the following vernacular command
</p>

<div class="org-src-container">

<pre class="src src-coq">Print Assumptions my_lemma.
</pre>
</div>
</div>
</div>


<div id="outline-container-orgheadline33" class="outline-2">
<h2 id="orgheadline33"><span class="section-number-2">10</span> Using tactics like reflexivity over user built relations</h2>
<div class="outline-text-2" id="text-10">
<p>
The goal here is to be able to use coq's built-in tactics over other relations
than iff and eq, in particular relations that you have defined yourself.
</p>
</div>
<div id="outline-container-orgheadline31" class="outline-3">
<h3 id="orgheadline31"><span class="section-number-3">10.1</span> Adding equivalence relations, preorder, etc&#x2026;</h3>
<div class="outline-text-3" id="text-10-1">
<p>
The inner mechanism going on when using tactics like reflexivity,
transitivity or symmetry is typeclasses. However coq allows a particular
facility to declare new relation without digging into this.  The syntax goes
roughly as follows:
</p>

<div class="org-src-container">

<pre class="src src-coq">Add Parametric Relation (A: Type): A (@R A)
reflexivity proved by ...
symmetry proved by ...
transitivity proved by ...
as R_is_an_equivalence_relation.
</pre>
</div>

<p>
Note that you naturally only want to take A as a parameter if your relation
is indeed polymorphic.  For instance, suppose you need to manipulate
predicates over program states up to propositional extentional
equivalence. This relation is an equivalence relation, so you might want to
declare it as so.
</p>

<div class="org-src-container">

<pre class="src src-coq">Axiom state: Type.
Definition Pred: state -&gt; Prop.
Definition PEq (P1 P2: Pred): Prop := forall x, P1 x &lt;-&gt; P2 x.
Lemma PEq_reflexive: forall P, P ≡ P.
Proof.
  intros P s; go.
Qed.

Lemma PEq_trans: forall P1 P2 P3 (H1: P1 ≡ P2) (H2: P2 ≡ P3),
    P1 ≡ P3.
  intros P1 P2 P3 H1 H2 s; split; intros H3; [apply H2, H1 | apply H1,H2]; assumption.
Qed.

Lemma PEq_symm: forall P1 P2 (H: P1 ≡ P2), P2 ≡ P1.
Proof.
  intros P1 P2 H s; split; intros H'; apply H; assumption.
Qed.

Add Parametric Relation: Pred PEq
    reflexivity proved by PEq_reflexive
    symmetry proved by PEq_symm
    transitivity proved by PEq_trans
      as PEq_equiv.
</pre>
</div>

<p>
We now are able to prove goals such that <code>(forall P: Pred, PEq P P)</code> with a
simpl (<code>intros P; reflexivity</code>). Same goes for <code>transitivity</code> and <code>symmetry</code>.
</p>

<p>
Note that we can also only declare some of those properties, declaring that a
relation is a preorder for instance:
</p>

<div class="org-src-container">

<pre class="src src-coq">Definition PWeaker (P1 P2: Pred): Prop := forall s, P2 s -&gt; P1 s.

Lemma PWeaker_reflexive: forall P, P ⊆ P.
Proof.
  go.
Qed.

Lemma PWeaker_trans: forall P1 P2 P3 (H1: P1 ⊆ P2) (H2: P2 ⊆ P3), P1 ⊆ P3.
Proof.
  intros P1 P2 P3 H1 H2 s H3; apply H1,H2,H3.
Qed.

Add Parametric Relation: Pred PWeaker
    reflexivity proved by PWeaker_reflexive
    transitivity proved by PWeaker_trans
      as PWeaker_preorder.
</pre>
</div>

<p>
In this case naturally <code>symmetry</code> will not work.  Note that you are not
required to provide the appropriate proof term directly in the relation
declaration, you may use wildcards for coq to require the proofs
interactively.
</p>

<p>
Remark: As said earlier, what is really going on is the typeclass
mechanism. So all this is simply sugar for an instance declaration to the
appropriate type class, Equivalence for example in the first case. We could
have written instead:
</p>

<div class="org-src-container">

<pre class="src src-coq">Require Import Classes.RelationClasses.

Instance PEq_equiv: @Equivalence Pred PEq :=
 Equivalence_Reflexive := PEq_reflexive
 Equivalence_Symmetric := PEq_symm
 Equivalence_Transitive := PEq_trans.
</pre>
</div>
</div>
</div>
